# Taps
tap "homebrew/bundle"

# ============================================
# CLI Tools
# ============================================

# Shell & Terminal
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"              # Optional: modern prompt


# Version Manager
brew "asdf"                  # Universal version manager for Node.js, Python, Go, etc.

# DevOps Tools (tools not managed by asdf)
brew "kubectx"               # Switch contexts/namespaces quickly
brew "k9s"                   # Kubernetes TUI
brew "helm"
brew "kustomize"
brew "stern"                 # Multi-pod log tailing
brew "terragrunt"

# Container Tools
brew "docker"
brew "docker-compose"
brew "colima"                # Docker runtime for Mac

# Development Tools
brew "jq"                    # JSON processor
brew "yq"                    # YAML processor
brew "fzf"                   # Fuzzy finder
brew "ripgrep"               # Fast search
brew "bat"                   # Better cat
brew "eza"                   # Better ls
brew "tree"
brew "htop"
brew "watch"
brew "wget"
brew "curl"
brew "tmux"

# Networking
brew "httpie"
brew "grpcurl"

# ============================================
# Cask Applications
# ============================================

# Terminal
cask "iterm2"

# IDE & Editors
cask "visual-studio-code"

# API Development
cask "postman"

# Containers
cask "docker"

# Browsers
cask "google-chrome"

# Communication
cask "slack"
cask "zoom"

# ============================================
# VS Code Extensions (optional)
# ============================================

vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "eamodio.gitlens"
vscode "redhat.vscode-yaml"
