# Taps
tap "homebrew/bundle"
tap "hashicorp/tap"

# ============================================
# CLI Tools
# ============================================

# Shell & Terminal
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"              # Optional: modern prompt

# Git
brew "git"
brew "gh"                    # GitHub CLI
brew "git-delta"             # Better diff viewer

# DevOps Tools
brew "kubectl"
brew "kubectx"               # Switch contexts/namespaces quickly
brew "k9s"                   # Kubernetes TUI
brew "helm"
brew "kustomize"
brew "stern"                 # Multi-pod log tailing
brew "hashicorp/tap/terraform"
brew "terragrunt"
brew "ansible"
brew "awscli"
brew "azure-cli"

# Container Tools
brew "docker"
brew "docker-compose"
brew "colima"                # Docker runtime for Mac

# Programming Languages
brew "go"
brew "node"
brew "nvm"
brew "python"
brew "pyenv"

# Development Tools
brew "jq"                    # JSON processor
brew "yq"                    # YAML processor
brew "fzf"                   # Fuzzy finder
brew "ripgrep"               # Fast search
brew "bat"                   # Better cat
brew "eza"                   # Better ls
brew "tree"
brew "htop"
brew "watch"
brew "wget"
brew "curl"
brew "tmux"

# Networking
brew "httpie"
brew "grpcurl"

# ============================================
# Cask Applications
# ============================================

# Terminal
cask "iterm2"

# IDE & Editors
cask "visual-studio-code"

# API Development
cask "postman"

# Containers
cask "docker"

# Browsers
cask "google-chrome"
cask "firefox"

# Productivity
cask "rectangle"             # Window management
cask "raycast"               # Spotlight replacement
cask "1password"             # Password manager

# Communication
cask "slack"
cask "zoom"

# ============================================
# VS Code Extensions (optional)
# ============================================

vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "eamodio.gitlens"
vscode "redhat.vscode-yaml"
